/* 
    数组学习：2026/04/15
    
    内容：二维数组

    Note:
            //1 2 3 4
            //2 3 4 5
            //3 4 5 6
        1、arr[3][4] -> 3行4列
           arr[行常量][列常量]
           
        2、如果初始化数据没写完整，那么优先前几位，后几位自动补0
        
        3、初始化二维数组时，只能省略行常量，不能省略列常量
        
        4、二维数组中每个元素都是连续（地址连续）存放的
*/

#include<stdio.h>

int main(){
    
    //二维数组创建
    int arr1[3][4];
    char arr2[2][5];
    
    //二维数组初始化
    int arr3[3][2] = {1,2,3,4,5,6};
    int arr5[3][2] = {{1,2},{3,4},{5,6}};
    //arr3 和 arr5 监视结果为 1 2
    //               3 4
    //               5 6
    int arr4[2][2] = {1,2}; //如果初始化数据没写完整，那么优先前几位，后几位自动补0
    //arr4监视结果为 1 2
    //               0 0
    int arr6[3][4] = {{1,2},{3,4},{5,6}};
    //arr6监视结果为 1 2 0 0
    //               3 4 0 0
    //               5 6 0 0
    int arr7[][4] = {{1,2,3},{3,4},{5,6}}; //只能省略行常量，不能省略列常量
    //arr7监视结果为 1 2 3 0
    //               3 4 0 0
    //               5 6 0 0
    
    // 打印每行每列的数值
    int row = 0;
    int col = 0;
    for(row = 0; row < 3; row++){
        for(col = 0; col < 4; col++){
            printf("%d ", arr7[row][col]);
            printf("&arr7[%d][%d] = %p\n",row,col,&arr7[row][col]);//打印每个元素的地址，%p打印地址
        }
        printf("\n");
    }
    
    /*  
    1 &arr7[0][0] = 000000000061FD10
    2 &arr7[0][1] = 000000000061FD14
    3 &arr7[0][2] = 000000000061FD18
    0 &arr7[0][3] = 000000000061FD1C

    3 &arr7[1][0] = 000000000061FD20
    4 &arr7[1][1] = 000000000061FD24
    0 &arr7[1][2] = 000000000061FD28
    0 &arr7[1][3] = 000000000061FD2C

    5 &arr7[2][0] = 000000000061FD30
    6 &arr7[2][1] = 000000000061FD34
    0 &arr7[2][2] = 000000000061FD38
    0 &arr7[2][3] = 000000000061FD3C 
    */
    
    /*  
    // 给数组的每个元素重新赋值
    for(row = 0; row < 3; row++){
        for(col = 0; col < 2; col++){
            scanf("%d",&arr5[row][col]);
        }
    } 
    
    // 给数组的每个元素重新赋值
    for(row = 0; row < 3; row++){
        for(col = 0; col < 2; col++){
            printf("%d ", arr5[row][col]);
        }
        printf("\n");
    } 
    */
    
    // 数组作为函数传参
    
    
    // printf("hello world!\n");
    return 0;
}